
# Kubernetes操作ビュー
Kubernetesのオペラティブビューは、次のように機能を提供します
ノードをレンダリングし、その全体的な状態を示す（「準備完了」）
ノード容量とリソース使用率（CPU、メモリ）を表示
CPUごとに1つの「ボックス」をレンダリングし、ポッドCPUの要求/使用量の合計
合計メモリの垂直バーをレンダリングし、ポッドメモリの要求/使用量の合計
個々のポッドをレンダリングする
ポッドの状態を境界線の色（緑：実行可能/実行中、黄色：保留中、赤：エラーなど）で示します。
小さな縦棒で現在のCPU /メモリ使用量を表示する（Heapsterから収集）
システムポッド（「kube-system」名前空間）は、一番下にグループ化されます
ノードとポッドのツールチップ情報を提供する
ポッドの作成と終了をアニメートする
Kubernetes運用ビューはこの試用版に配備されており、
ブラウザで新しいタブを開き、KubeOpsViewブックマークをクリックしてください
または、ナビゲーションメニューから起動 - >ワークロード - >デプロイメント - > mykube-view-kube-ops-viewをクリックして起動することもできます
